---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.OvalDuctSizeSuffix
source: html/01a4fd90-4660-a555-b3d4-4388b3e9b4c3.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.OvalDuctSizeSuffix Property

The oval duct size suffix string.

## Syntax (C#)
```csharp
public string OvalDuctSizeSuffix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null